## checking sanity of datasets

#### duplicates

In [1]:
import pandas as pd
import numpy as np

from IPython.display import Image

In [2]:
students = [('Sri',    34, 'Sydeny'),
            ('Sai',    30, 'Delhi'),
            ('Anand',  16, 'Singapore'),
            ('Steve',  30, 'Delhi'),
            ('Anand',   16, 'Singapore'),
            ('Priti',    30, 'Mumbai'),
            ('popcorn.ai', 40, 'Delhi'),
            ('popcorn.ai', 30, 'Delhi'),
            ('Anand',   16, 'Singapore'),
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])
df

         Name  Age       City
0         Sri   34     Sydeny
1         Sai   30      Delhi
2       Anand   16  Singapore
3       Steve   30      Delhi
4       Anand   16  Singapore
5       Priti   30     Mumbai
6  popcorn.ai   40      Delhi
7  popcorn.ai   30      Delhi
8       Anand   16  Singapore

#### Find Duplicate Rows based on all columns

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8     True
dtype: bool

In [4]:
df.duplicated(keep='last')

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8    False
dtype: bool

In [5]:
# Select duplicate rows except first occurrence based on all columns
duplicateRowsDF = df[df.duplicated(keep='last')]

print("Duplicate Rows except first occurrence based on all columns are :")
duplicateRowsDF

Duplicate Rows except first occurrence based on all columns are :

    Name  Age       City
2  Anand   16  Singapore
4  Anand   16  Singapore

In [6]:
# Select duplicate rows except last occurrence based on all columns
duplicateRowsDF = df[df.duplicated(keep='first')]
 
print("Duplicate Rows except last occurrence based on all columns are :")
duplicateRowsDF

Duplicate Rows except last occurrence based on all columns are :

    Name  Age       City
4  Anand   16  Singapore
8  Anand   16  Singapore

## Find Duplicate Rows based on selected columns

#### find & select rows based on a single column,

In [8]:
# Select all duplicate rows based on one column
duplicateRowsDF = df[df.duplicated(['Name'], keep='first')]

print("Duplicate Rows based on a single column are:", duplicateRowsDF, sep='\n')

Duplicate Rows based on a single column are:
         Name  Age       City
4       Anand   16  Singapore
7  popcorn.ai   30      Delhi
8       Anand   16  Singapore

Here rows which has same value in ‘Name’ column are marked as duplicate and returned.

#### Find & select rows based on a two column names,

In [9]:
# Select all duplicate rows based on multiple column names in list
duplicateRowsDF = df[df.duplicated(['Age', 'City'], keep='first')]
 
print("Duplicate Rows based on 2 columns are:", duplicateRowsDF, sep='\n')

Duplicate Rows based on 2 columns are:
         Name  Age       City
3       Steve   30      Delhi
4       Anand   16  Singapore
7  popcorn.ai   30      Delhi
8       Anand   16  Singapore

Here rows which has same values in ‘Age’  & ‘City’ columns are marked as duplicate and returned.

## Dropping duplicates from a particular column

In [9]:
students = [('Sri',    34, 'Sydeny'),
            ('Sai',    30, 'Delhi'),
            ('Anand',  16, 'Singapore'),
            ('Steve',  30, 'Delhi'),
            ('Anand',   16, 'Singapore'),
            ('Priti',    30, 'Mumbai'),
            ('popcorn.ai', 40, 'Delhi'),
            ('popcorn.ai', 30, 'Delhi')
            ]
 
# Create a DataFrame object
df = pd.DataFrame(students, columns=['Name', 'Age', 'City'])
df

         Name  Age       City
0         Sri   34     Sydeny
1         Sai   30      Delhi
2       Anand   16  Singapore
3       Steve   30      Delhi
4       Anand   16  Singapore
5       Priti   30     Mumbai
6  popcorn.ai   40      Delhi
7  popcorn.ai   30      Delhi

In [10]:
df.drop_duplicates(['Name'], keep='first', inplace=False)

         Name  Age       City
0         Sri   34     Sydeny
1         Sai   30      Delhi
2       Anand   16  Singapore
3       Steve   30      Delhi
5       Priti   30     Mumbai
6  popcorn.ai   40      Delhi

In [11]:
df.drop_duplicates(['Name', 'City'], keep='first', inplace=False)

         Name  Age       City
0         Sri   34     Sydeny
1         Sai   30      Delhi
2       Anand   16  Singapore
3       Steve   30      Delhi
5       Priti   30     Mumbai
6  popcorn.ai   40      Delhi